wikimedia/smash-pig/Tests/SoapInjector/actual.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soap:Body><ns1:sendNotification xmlns:ns1="http://notification.services.adyen.com"><ns1:notification><live xmlns="http://notification.services.adyen.com">false</live><notificationItems xmlns="http://notification.services.adyen.com"><NotificationRequestItem><additionalData xsi:nil="true" /><amount><currency xmlns="http://common.services.adyen.com">USD</currency><value xmlns="http://common.services.adyen.com">500</value></amount><eventCode>AUTHORISATION</eventCode><eventDate>2013-01-24T03:34:35.760+01:00</eventDate><merchantAccountCode>WikimediaCOM</merchantAccountCode><merchantReference>5376573006</merchantReference><operations><string>CANCEL</string><string>CAPTURE</string><string>REFUND</string></operations><originalReference xsi:nil="true" /><paymentMethod>visa</paymentMethod><pspReference>8813589948752137</pspReference><reason>8204:1111:6/2016</reason><success>true</success></NotificationRequestItem></notificationItems></ns1:notification></ns1:sendNotification></soap:Body></soap:Envelope>
